Repository: elviskudo/clinic-mobile
Catalog: lib/l10n/intl_*.arb
Languages: id

# offline
source: Oops! It looks like you're offline.
id: Ups! Sepertinya Anda sedang offline.

# pageOnboardingTitle
source: Welcome to Clinic!
id: Selamat Datang di Clinic!

# pageOnboardingDescription
source: Experience the ease of scheduling medical checkup anytime, anywhere with our app.
id: Rasakan kemudahan membuat jadwal pemeriksaan medis kapan saja, dimana saja dengan aplikasi kami.

source: Sign in
id: Masuk

# signInError
source: Failed to sign in. Make sure your credentials is valid before trying again.
id: Gagal masuk. Pastikan kredensial kamu valid sebelum mengulangi pembuatan akun.

# signUp
source: Create an account
id: Buat akun

# signUpError
source: Failed to create an account. Make sure your credentials is valid before trying again.
id: Gagal membuat akun. Pastikan kredensial kamu valid sebelum mengulangi pembuatan akun.

# verificationError
source: Account verification failed. Try to resend otp code.
id: Verifikasi akun gagal. Coba untuk kirim ulang kode otp.

# pageSignUpDescription
source: Start with make an account and then you can check your health anytime, anywhere!
id: Mulai dengan membuat akun dan kamu bisa cek kesehatan kapanpun, dimanapun!

# pageSignUpHadAccount
source: Already have an account yet?
id: Sudah punya akun?

# pageSignInTitle
source: Hi, Welcome!
id: Hi, Selamat Datang!

# pageSignInDescription
source: Hello, how are you? not feeling great? Don't worry we got you covered, check your health easily!
id: Halo, apakabar? kurang enak badan? Jangan khawatir, cek kesehatanmu dengan mudah!

# pageSignInNoAccount
source: Don't have an account yet?
id: Belum punya akun?

source: Or
id: atau

# pageHomeAddAppointment
source: Add Appointment
id: Buat Jadwal

# pageHomeMicrocopyDesc
source: How's Your health?
id: Bagaimana kesehatan mu?

# inputNameLabel
source: Fullname
id: Nama lengkap

# inputNamePlaceholder
source: Your full name here.
id: Nama lengkap kamu.

# errorNameValidationEmpty
source: Please enter your full name.
id: Silahkan masukkan nama lengkap kamu.

# errorEmailValidationEmpty
source: Please enter your email address.
id: Silahkan masukkan alamat email kamu.

# errorEmailValidationInvalid
source: Please enter a valid email address (e.g., user@example.com).
id: Silahkan masukkan alamat email yang valid (contoh, user@example.com).

# inputPhoneLabel
source: Phone Number
id: No. Handphone

# inputPhonePlaceholder
source: Your phone number.
id: No. handphone kamu.

# errorPhoneValidationInvalid
source: Please enter a valid phone number.
id: Silahkan masukkan no. hp yang valid.

# inputPasswordPlaceholder
source: Enter your password (min 8 characters).
id: Masukkan password kamu (minimal 8 karakter).

# inputPasswordDescription
source: • Should contain at least one upper case • Should contain at least one lower case • Should contain at least one digit • Should contain at least one special character
id: • Perlu setidaknya satu huruf besar • Perlu setidaknya satu huruf kecil • Perlu setidaknya satu angka • Perlu setidaknya satu karakter khusus

# errorPasswordValidationEmpty
source: Please enter your password.
id: Silahkan masukkan password kamu.

# errorPasswordValidationInvalid
source: Password must be at least 8 characters or more & make sure to match the requirements.
id: Password harus sedikitnya 8 karakter atau lebih & pastikan sesuai dengan kriteria.

# inputConfirmationPasswordLabel
source: Confirmation Password
id: Konfirmasi Password

# errorConfirmationPasswordValidationInvalid
source: Confirmation password must be same as password.
id: Konfirmasi password harus sama dengan password.

source: Verification
id: Verifikasi

# verificationButtonText
source: Verify
id: Verifikasi

# pageVerificationDescription
source: Enter the verification code (OTP) that we have sent to your email.
id: Masukkan kode verifikasi (OTP) yang sudah kami kirimkan ke email kamu.

# pageVerificationResendNotice
source: Did'nt recieve the verification code yet?
id: Belum menerima kode verifikasi?

source: Resend
id: Kirim ulang
